// Copyright (c) 2019, MaiHD. All right reversed.
// License: Unlicensed

#pragma once

// Supported platforms
#define PLATFORM_WINDOWS 0 // Platform family: windows  - winrt, win32
#define PLATFORM_UNIX    0 // Platform family: unix     - android, linux
#define PLATFORM_APPLE   0 // Platform family: apple    - ios, osx
#define PLATFORM_WEB     0 // Platform family: web      - asmjs, wasm
#define PLATFORM_WINRT   0
#define PLATFORM_ANDROID 0
#define PLATFORM_LINUX   0
#define PLATFORM_ASMJS   0
#define PLATFORM_WASM    0
#define PLATFORM_IOS     0
#define PLATFORM_OSX     0

// Supported cpus
#define CPU_ARM   0
#define CPU_JIT   0
#define CPU_MIPS  0
#define CPU_PPC   0
#define CPU_RISCV 0
#define CPU_X86   0

// Platform: Windows family
#if defined(_MSC_VER) || defined(_WIN32) || defined(__MINGW64__)
#   undef  PLATFORM_WINDOWS
#   define PLATFORM_WINDOWS 1
#   if !defined(__MINGW64__) && defined(WINAPI_FAMILY) && (WINAPI_FAMILY != WINAPI_FAMILY_DESKTOP_APP)
#       undef  PLATFORM_WINRT
#       define PLATFORM_WINRT 1
#   endif
#endif

// Platform: Unix family
#if defined(__unix__)
#   undef  PLATFORM_UNIX
#   define PLATFORM_UNIX 1
#
#   if defined(__ANDROID__)
#       undef  PLATFORM_ANDROID
#       define PLATFORM_ANDROID 1
#   elif defined(__linux__)
#       undef  PLATFORM_LINUX
#       define PLATFORM_LINUX 1
#   endif
#endif

// Platform: native web family
#if defined(__EMSCRIPTEN__)
#   undef  PLATFORM_WEB
#   define PLATFORM_WEB 1
#   if defined(__asmjs__)

#elif defined(__x86_64__) || defined(_M_X64)
#   define CPU_NAME "amd64"
#else
#   define CPU_NAME "x86"
#endif

// Platform name
#if PLATFORM_WINRT
#   define PLATFORM_NAME   "winrt"
#   define PLATFORM_FAMILY "Windows_NT"
#elif PLATFORM_WINDOWS
#   define PLATFORM_NAME   "windows"
#   define PLATFORM_FAMILY "Windows_NT"
#elif PLATFORM_ANDROID
#   define PLATFORM_NAME   "android"
#   define PLATFORM_FAMILY "Linux"
#elif PLATFORM_LINUX
#   define PLATFORM_NAME   "linux"
#   define PLATFORM_FAMILY "Linux"
#elif PLATFORM_ASMJS
#   define PLATFORM_NAME   "asmjs"
#   define PLATFORM_FAMILY "Web"
#elif PLATFORM_WASM
#   define PLATFORM_NAME   "wasm"
#   define PLATFORM_FAMILY "Web"
#elif PLATFORM_IOS
#   define PLATFORM_NAME   "ios"
#   define PLATFORM_FAMILY "Darwin"
#elif PLATFORM_OSX
#   define PLATFORM_NAME   "osx"
#   define PLATFORM_FAMILY "Darwin"
#endif

// Detect target library compile
#ifndef RIKU_API
#   ifdef RIKU_SHARED
#       if PLATFORM_WINDOWS
#           ifdef RIKU_EXPORT
#               define RIKU_API __declspec(dllexport)
#           else
#               define RIKU_API __declspec(dllimport)
#           endif
#       else
#           define RIKU_API __attribute__((visible("default")))
#       endif
#   else
#       define RIKU_API
#   endif
#endif

// Extension operators and specifier

#ifndef __has_declspec_attribute       // Optional of course.
#define __has_declspec_attribute(x) 0  // Compatibility with non-clang compilers.
#endif

#if defined(EXTENSION_PROPERTY)
#   if defined(_MSC_VER) || ((defined(__has_declspec_attribute) && __has_declspec_attribute(property)))
#      define PROPERTY(Type, name, getter, setter)   __declspec(property(get=getter, put=setter)) Type name
#      define PROPERTY_READONLY(Type, name, getter)  __declspec(property(get=getter)) Type name
#      define PROPERTY_WRITEONLY(Type, name, setter) __declspec(property(put=setter)) Type name
#   else
#      define PROPERTY(Type, name, getter, setter)   
#      define PROPERTY_READONLY(Type, name, getter)  
#      define PROPERTY_WRITEONLY(Type, name, setter) 
#   endif
#else
#   define PROPERTY(Type, name, getter, setter)   
#   define PROPERTY_READONLY(Type, name, getter)  
#   define PROPERTY_WRITEONLY(Type, name, setter) 
#endif

#if defined(_MSC_VER)
#   define __threadstatic __declspec(thread) static
#else
#   define __threadstatic static __thread
#endif

// Primitive types

using uint   = unsigned int;
using ulong  = unsigned long int;
using ushort = unsigned short int;

using cstr   = const char*;
using wchar  = short;
using uchar  = int;

// Fixed size types

#if PLATFORM_WINDOWS || (CPU_ARM && ARCH_32BIT)
using i8  = char;
using u8  = unsigned char;
using i16 = short;
using u16 = unsigned short;
using i32 = long;
using u32 = unsigned long;
using i64 = long long;
using u64 = unsigned long long;
#else
using i8  = char;
using u8  = unsigned char;
using i16 = short;
using u16 = unsigned short;
using i32 = int;
using u32 = unsigned int;
using i64 = long;
using u64 = unsigned long;
#endif

static_assert(sizeof(i8)  == 1, "i8 must be 1-bytes size.");
static_assert(sizeof(u8)  == 1, "u8 must be 1-bytes size.");
static_assert(sizeof(i16) == 2, "i16 must be 2-bytes size.");
static_assert(sizeof(u16) == 2, "u16 must be 2-bytes size.");
static_assert(sizeof(i32) == 4, "i32 must be 4-bytes size.");
static_assert(sizeof(u32) == 4, "u32 must be 4-bytes size.");
static_assert(sizeof(i64) == 8, "i64 must be 8-bytes size.");
static_assert(sizeof(u64) == 8, "u64 must be 8-bytes size.");

using byte  = u8;
using sbyte = i8;
static_assert(sizeof(byte)  == 1, "byte must be 1-bytes size.");
static_assert(sizeof(sbyte) == 1, "sbyte must be 1-bytes size.");

// Memory address and size types

#if ARCH_64BIT
using usize = u64;
using isize = i64;
#else 
using usize = u32;
using isize = i32;
#endif

using iptr = isize;
using uptr = usize;

using Flags   = u32;
using Flags64 = u64;

// NULL
#if !defined(NULL)
#   define NULL 0
#endif

// Type of null pointer
using NullPtr = decltype(nullptr);

// ArgsList: alias of va_list
#include <stdarg.h>
using ArgsList = va_list;
#define argslist_begin(args_list, prev_arg) va_start(args_list, prev_arg)
#define argslist_next(args_list, Type)      va_arg(args_list, Type)
#define argslist_copy(dst, src)             va_copy(dst, src)
#define argslist_end(args_list)             va_end(args_list)

// Assertion helper
#define ALWAYS_ASSERT(exp, fmt, ...) (!(exp) ? (void)::console::log_assert(#exp, __FUNCTION__, __FILE__, __LINE__, fmt, ##__VA_ARGS__) : (void)0)
